Enums/ВидыПодписантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПодписантов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодписантОтКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантОтОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРегистрацииТС</Name>
					<Comment>Свидетельство о регистрации ТС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство о государственной регистрации индивидуального предпринимателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныйПТС</Name>
					<Comment>Электронный паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительствоИностранногоГражданина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительскоеУдостоверение</Name>
					<Comment>Вид документа водительское удостоверение </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устав</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагУволен</Name>
					<Comment>Флаг уволен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения сотрудника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Признак сотрудника как исполнителя работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Comment>Имя используемое для представления в "Записи на ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Карточка сотрудника для входа в АРМ "Сотрудник цеха"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРесурса</Name>
					<Comment>Тип ресурса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет в списке планируемых ресурсов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФаксимилеПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПланировании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИспользованияРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/РедактированиеРеквизитовПечати/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьОсновныеПараметры(Параметры);
	НастроитьФорму(Параметры);
	ЗаполнитьВозможныеАдресаДоставки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	ГрузополучательПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПеревозкаАвтотранспортомПриИзменении(Элемент)
	
	Элементы.ГруппаАвтотранспорт.ТолькоПросмотр = Не ЭтоПеревозкаАвтотранспортом;
	
	Если Не ЭтоПеревозкаАвтотранспортом Тогда
		
		СброситьРеквизитыАвтомобиля();
		СброситьРеквизитыПрицепа();
		
		Элементы.ГруппаАвтотранспортПрицеп.ТолькоПросмотр = Не ЕстьПрицеп;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьПрицепПриИзменении(Элемент)
	
	Если Не ЕстьПрицеп Тогда
		
		СброситьРеквизитыПрицепа();
		
	КонецЕсли;
	
	Элементы.ГруппаАвтотранспортПрицеп.ТолькоПросмотр = Не ЕстьПрицеп;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму(
		"Справочник.Сотрудники.ФормаВыбора",
		Новый Структура("РежимВыбора", Истина),
		Элемент,
		КлючУникальности,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Сотрудники"), ПараметрыПолученияДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВодительскогоУдостоверенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("РежимВыбора,Отбор", Истина, ОтборВодительскогоУдостоверения());
	
	ОткрытьФорму(
		"Справочник.ПодтверждающиеДокументы.ФормаВыбора",
		ПараметрыФормы,
		Элемент,
		КлючУникальности,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВодительскогоУдостоверенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ДанныеВыбранногоУдостоверения = ДанныеВыбранногоУдостоверения(ВыбранноеЗначение);
		ВыбранноеЗначение = ДанныеВыбранногоУдостоверения.Номер;
		Водитель = ДанныеВыбранногоУдостоверения.Владелец;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВодительскогоУдостоверенияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПолученияДанных.Отбор = ОтборВодительскогоУдостоверения();
	ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	ПараметрыПолученияДанных.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть;
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ПодтверждающиеДокументы"), ПараметрыПолученияДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура МодельАвтомобиляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму(
		"Справочник.Модели.ФормаВыбора",
		Новый Структура("РежимВыбора", Истина),
		Элемент,
		КлючУникальности,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура МодельАвтомобиляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Модели"), ПараметрыПолученияДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерАвтомобиляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму(
		"Справочник.Автомобили.ФормаВыбора",
		Новый Структура("РежимВыбора", Истина),
		Элемент,
		КлючУникальности,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерАвтомобиляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ДанныеВыбранногоАвтомобиля = ДанныеВыбранногоАвтомобиля(ВыбранноеЗначение);
		ВыбранноеЗначение = ДанныеВыбранногоАвтомобиля.ГосНомер;
		МодельАвтомобиля = ДанныеВыбранногоАвтомобиля.Модель;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерАвтомобиляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПолученияДанных.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	ПараметрыПолученияДанных.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть;
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Автомобили"), ПараметрыПолученияДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ЭтоПеревозкаАвтотранспортом И (НЕ ЗначениеЗаполнено(МодельАвтомобиля) ИЛИ НЕ ЗначениеЗаполнено(ГосНомерАвтомобиля)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Модель и гос. номер автомобиля должны быть заполнены");
		Возврат;
	КонецЕсли;
		
	Если ЕстьПрицеп И (НЕ ЗначениеЗаполнено(МодельПрицепа) ИЛИ НЕ ЗначениеЗаполнено(ГосНомерПрицепа)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Модель и гос. номер прицепа должны быть заполнены");
		Возврат;
	КонецЕсли;
	
	РеквизитовДоставки = УправлениеПечатьюКлиентАльфаАвто.ПолучитьПустуюСтруктуруРеквизитовДоставки();
	
	ЗаполнитьЗначенияСвойств(РеквизитовДоставки, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект.ВладелецФормы.Объект, РеквизитовДоставки);
	
	ЭтотОбъект.ВладелецФормы.Модифицированность = Истина;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОсновныеПараметры(ВходныеПараметры)
	
	ВходныеПараметры.Свойство("АдресДоставки", АдресДоставки);
	ВходныеПараметры.Свойство("Водитель", Водитель);
	ВходныеПараметры.Свойство("ГосНомерАвтомобиля", ГосНомерАвтомобиля);
	ВходныеПараметры.Свойство("ГосНомерПрицепа", ГосНомерПрицепа);
	ВходныеПараметры.Свойство("Грузоотправитель", Грузоотправитель);
	ВходныеПараметры.Свойство("Грузополучатель", Грузополучатель);
	ВходныеПараметры.Свойство("ЕстьПрицеп", ЕстьПрицеп);
	ВходныеПараметры.Свойство("МодельАвтомобиля", МодельАвтомобиля);
	ВходныеПараметры.Свойство("МодельПрицепа", МодельПрицепа);
	ВходныеПараметры.Свойство("ОписаниеГруза", ОписаниеГруза);
	ВходныеПараметры.Свойство("Перевозчик", Перевозчик);
	ВходныеПараметры.Свойство("ЭтоПеревозкаАвтотранспортом", ЭтоПеревозкаАвтотранспортом);
	ВходныеПараметры.Свойство("НомерВодительскогоУдостоверения", НомерВодительскогоУдостоверения);
	ВходныеПараметры.Свойство("Руководитель", Руководитель);
	ВходныеПараметры.Свойство("ГлавныйБухгалтер", ГлавныйБухгалтер);
	ВходныеПараметры.Свойство("Отпустил", Отпустил);
    ВходныеПараметры.Свойство("Получил", Получил);  
	ВходныеПараметры.Свойство("Принял", Принял);
	ВходныеПараметры.Свойство("Организация", Организация); 
	ВходныеПараметры.Свойство("ПодразделениеКомпании", ПодразделениеКомпании); 
	ВходныеПараметры.Свойство("Контрагент", Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(ВходныеПараметры)
	
	МетаданныеВладельца = Метаданные.НайтиПоПолномуИмени(ВходныеПараметры.ИмяВладельца);
	Доступность     	= ПравоДоступа("Изменение", МетаданныеВладельца);
	
	ОграничитьТипГрузоотправителя(МетаданныеВладельца);
	ОграничитьТипГрузополучателя(МетаданныеВладельца); 
	
	Элементы.ПервыйОтступ.Видимость = Элементы.Грузоотправитель.Видимость Или Элементы.Грузополучатель.Видимость;
    
	Элементы.ГруппаАвтотранспорт.ТолькоПросмотр = Не ЭтоПеревозкаАвтотранспортом;
	Элементы.ГруппаАвтотранспортПрицеп.ТолькоПросмотр = Не ЕстьПрицеп; 
	
	Если МетаданныеВладельца.Реквизиты.Найти("Принял")=Неопределено Тогда
		Элементы.Принял.Видимость = Ложь;
	КонецЕсли;
	
	Если МетаданныеВладельца.Реквизиты.Найти("Отпустил")=Неопределено Тогда
		Элементы.Отпустил.Видимость = Ложь;
	КонецЕсли; 
	
    Если МетаданныеВладельца.Реквизиты.Найти("Получил")=Неопределено Тогда
		Элементы.Получил.Видимость = Ложь;
	КонецЕсли; 

	ДокументыПоступления = Новый Массив();
	ДокументыПоступления.Добавить("ПоступлениеТоваров");
	ДокументыПоступления.Добавить("ПоступлениеАвтомобилей");
	ДокументыПоступления.Добавить("ПоступлениеДопРасходов");
	ДокументыПоступления.Добавить("СчетФактураПолученный"); 
	ДокументыПоступления.Добавить("КорректировкаПоступления");
	ДокументыПоступления.Добавить("КорректировкаПоступленияАвтомобилей");

	ДокументыРеализации = Новый Массив();
	ДокументыРеализации.Добавить("СчетФактураВыданный"); 
	ДокументыРеализации.Добавить("РеализацияТоваров");
	ДокументыРеализации.Добавить("РеализацияАвтомобилей");
	ДокументыРеализации.Добавить("РеализацияАктивов");
	ДокументыРеализации.Добавить("КорректировкаРеализации");
	ДокументыРеализации.Добавить("КорректировкаРеализацииАвтомобилей");
	ДокументыРеализации.Добавить("АктРазногласий");
	ДокументыРеализации.Добавить("ВозвратПоставщику"); 
	ДокументыРеализации.Добавить("ВозвратПоставщикуАвтомобилей");
	ДокументыРеализации.Добавить("ЗаказНаряд");
	ДокументыРеализации.Добавить("Чек");
	ДокументыРеализации.Добавить("ОтчетКомиссионера");
	ДокументыРеализации.Добавить("ОтчетКомиссионераЗаАвтомобили");

	ДокументыПеремещения = Новый Массив();
	ДокументыПеремещения.Добавить("ИзвлечениеТоваровИзПроизводства");
	ДокументыПеремещения.Добавить("ПеремещениеТоваровВПроизводство");
	ДокументыПеремещения.Добавить("ПеремещениеТоваров");
	ДокументыПеремещения.Добавить("ПеремещениеАвтомобилей");
	ДокументыПеремещения.Добавить("ПеремещениеНезавершенногоПроизводства");
	
	ПараметрыВыбораОрганизация = Новый Массив; 	
	ПараметрыВыбораОрганизация.Добавить(
		Новый ПараметрВыбора("Отбор.Организация", ВходныеПараметры.Организация)
	); 
	ПараметрыВыбораОрганизация.Добавить(
		Новый ПараметрВыбора("Отбор.ВидПодписанта", Перечисления.ВидыПодписантов.ПодписантОтОрганизации)
	); 
	
	ПараметрыВыбораПодразделение = Новый Массив();
	ПараметрыВыбораПодразделение.Добавить(
		Новый ПараметрВыбора("Отбор.Организация", ВходныеПараметры.Организация)
	); 
	ПараметрыВыбораПодразделение.Добавить(
		Новый ПараметрВыбора("Отбор.ПодразделениеКомпании", ВходныеПараметры.ПодразделениеКомпании)
	); 
	ПараметрыВыбораПодразделение.Добавить(
		Новый ПараметрВыбора("Отбор.ВидПодписанта", Перечисления.ВидыПодписантов.ПодписантОтОрганизации)
	); 
	
	ПараметрыВыбораКонтрагент = Новый Массив; 
	ПараметрыВыбораКонтрагент.Добавить(
		Новый ПараметрВыбора("Отбор.Контрагент", ВходныеПараметры.Контрагент)
	); 	
	ПараметрыВыбораКонтрагент.Добавить(
		Новый ПараметрВыбора("Отбор.ВидПодписанта", Перечисления.ВидыПодписантов.ПодписантОтКонтрагента)
	);
	
	Если ДокументыПоступления.Найти(МетаданныеВладельца.Имя)<> Неопределено Тогда
		
		Элементы.ГруппаОрганизация.Заголовок = "Контрагент";
		Элементы.ГруппаКонтрагент.Заголовок = "Организация";
		Элементы.ГруппаСведенияОПеревозчике.Видимость = Ложь;
		
		Элементы.Получил.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизация);
		Элементы.Принял.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизация);
			
		Элементы.Руководитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагент);
		Элементы.ГлавныйБухгалтер.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагент);
		Элементы.Отпустил.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагент); 
			
	ИначеЕсли ДокументыРеализации.Найти(МетаданныеВладельца.Имя) <> Неопределено Тогда
					
		Элементы.ГруппаСведенияОПеревозчике.Видимость = 
			МетаданныеВладельца.Имя = "РеализацияТоваров"  Или  МетаданныеВладельца.Имя = "РеализацияАвтомобилей"
		; 
				
		Элементы.Руководитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизация);
		Элементы.ГлавныйБухгалтер.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизация);
		Элементы.Отпустил.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПодразделение); 
					
		Элементы.Получил.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагент);
		Элементы.Принял.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагент);  
		
		
	ИначеЕсли ДокументыПеремещения.Найти(МетаданныеВладельца.Имя)<> Неопределено Тогда
		
		Элементы.ГруппаОрганизация.Видимость = Ложь;
		Элементы.ГруппаКонтрагент.Видимость = Ложь;
		Элементы.Отступ.Видимость = Ложь; 
			
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипГрузоотправителя(МетаданныеВладельца)
	
	ОписаниеРеквизита = МетаданныеВладельца.Реквизиты.Найти("Грузоотправитель");
	
	Если ОписаниеРеквизита = Неопределено Тогда
		
		Элементы.Грузоотправитель.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Элементы.Грузоотправитель.ОграничениеТипа = ОписаниеРеквизита.Тип;
	
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипГрузополучателя(МетаданныеВладельца)
	
	ОписаниеРеквизита = МетаданныеВладельца.Реквизиты.Найти("Грузополучатель");
	
	Если ОписаниеРеквизита = Неопределено Тогда
		
		Элементы.Грузополучатель.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Элементы.Грузополучатель.ОграничениеТипа = ОписаниеРеквизита.Тип;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВозможныеАдресаДоставки()
	
	Элементы.АдресДоставки.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	АдресаДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Грузополучатель,
		Перечисления.ТипыКонтактнойИнформации.Адрес,
		ТекущаяДатаСеанса(),
		Ложь
	);
	
	Для Каждого Адрес Из АдресаДоставки Цикл
		
		Элементы.АдресДоставки.СписокВыбора.Добавить(Адрес.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьРеквизитыАвтомобиля()
	
	МодельАвтомобиля   = "";
	ГосНомерАвтомобиля = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьРеквизитыПрицепа()
	
	ЕстьПрицеп      = Ложь;
	МодельПрицепа   = "";
	ГосНомерПрицепа = "";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборВодительскогоУдостоверения()
	
	Результат = Новый Структура("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ВодительскоеУдостоверение);
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеВыбранногоУдостоверения(Удостоверение)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Удостоверение, "Номер,Владелец");
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеВыбранногоАвтомобиля(Автомобиль)
	
	Возврат АвтомобилиСервер.ДанныеАвтомобиля(Автомобиль);
	
КонецФункции

&НаСервере
Процедура ГрузополучательПриИзмененииНаСервере()
	
	ЗаполнитьВозможныеАдресаДоставки();
	
КонецПроцедуры

#КонецОбласти
